Revit 2024 API
BalusterPattern.GetBalusterCount Method
 Gets the number of balusters in the main baluster pattern definition.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public int GetBalusterCount()
Visual Basic
Public Function GetBalusterCount As Integer
Visual C++
public:
int GetBalusterCount()
Return Value
 The number of balusters in the main baluster pattern.
See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace